{
    "start": {
      "text": "You're driving alone on a dark forest road, rain lashing against the windshield, when a deer suddenly jumps in front of your car. You swerve to avoid it, but lose control and crash into a tree.",
      "choices": [
        { "text": "Regain consciousness", "next": "crash_scene" }
      ]
    },
    "crash_scene": {
      "text": "You wake up with a jolt. Your head throbs, and the smell of gasoline fills the air. You're trapped in your mangled car, which rests against a thick oak tree at the edge of a deserted forest road. Your left leg throbs with pain, and you feel warm blood seeping through your jeans.",
      "choices": [
        { "text": "Assess your injuries", "next": "assess_injuries" },
        { "text": "Try to open the car door", "next": "open_door" },
        { "text": "Call out for help", "next": "call_help" }
      ]
    },
    "assess_injuries": {
      "text": "You carefully examine your leg. A deep gash runs along your shin, and the bone looks worryingly close to the surface. Movement sends a sharp pain through your leg, and the bleeding worsens.",
      "choices": [
        { "text": "Apply pressure to the wound", "next": "apply_pressure" },
        { "text": "Search the car for a first aid kit", "next": "search_car" },
        { "text": "Try to force the car door open and leave", "next": "leave_car_injured" }
      ]
    },
    "apply_pressure": {
      "text": "Using your belt as a makeshift tourniquet, you apply pressure to the wound, managing to slow the bleeding. However, without proper medical attention, you know the situation is still critical. The pain is intense.",
      "choices": [
        { "text": "Stay in the car and wait for help", "next": "wait_help" },
        { "text": "Attempt to hike to the abandoned house you saw earlier", "next": "hike_house" }
      ]
    },
    "search_car": {
      "text": "Ignoring the pain, you rummage through the glove compartment and find a basic first aid kit. You clean the wound as best you can and apply a bandage. It's not much, but it's better than nothing.",
      "choices": [
        { "text": "Stay in the car and wait for help", "next": "wait_help" },
        { "text": "Attempt to hike to the abandoned house you saw earlier", "next": "hike_house" }
      ]
    },
    "leave_car_injured": {
      "text": "You push against the car door, but it's jammed. You try the other door, but it's no use. Panic starts to set in. You manage to kick out a window, but the broken glass cuts your hands. You pull yourself out, ignoring the intense pain in your leg. The forest is dense, and night is falling fast.",
      "choices": [
        { "text": "Follow the road deeper into the forest", "next": "deep_forest" },
        { "text": "Take a barely visible path leading away from the road", "next": "away_path" }
      ]
    },
    "open_door": {
      "text": "With a groan of metal, the car door creaks open. The sound echoes through the silent forest. You freeze as you hear rustling in the undergrowth. A pair of yellow eyes gleam in the darkness, and then another, and another.  A pack of wolves emerges from the trees, drawn by the noise.",
      "choices": [
        { "text": "Try to fight them off", "next": "fight_wolves" },
        { "text": "Scramble back into the car and try to escape through the window", "next": "escape_window" }
      ]
    },
    "fight_wolves": {
      "text": "You try to fight off the wolves, but they are too many and too strong. You kick and scream, but they quickly overpower you.  ",
      "choices": [
        { "text": "Accept your fate", "next": "death" }
    ] 
    },
    "escape_window": {
      "text": "You manage to scramble through the window, but the broken glass leaves you with cuts on your arms and face. You stumble away from the car, the wolves hot on your heels.",
      "choices": [
        { "text": "Hide in the thick undergrowth", "next": "hide_undergrowth" },
        { "text": "Try to outrun the wolves", "next": "outrun_wolves" }
      ]
    },
    "hide_undergrowth": {
      "text": "You dive into the thick undergrowth, hoping the wolves will lose your scent. You lie perfectly still, your heart pounding in your chest. You hear the wolves sniffing around, their growls getting closer.  ",
      "choices": [
        { "text": "Hold your breath and stay hidden", "next": "stay_hidden" },
        { "text": "Make a run for it", "next": "run_from_hiding" }
      ]
    },
    "outrun_wolves": {
      "text": "You try to outrun the wolves, but they are faster and more agile. They quickly catch up to you, and you fall to the ground. ",
      "choices": [
        { "text": "Accept your fate", "next": "death" }
    ] 
    },
    "call_help": {
      "text": "You shout for help, but your voice is hoarse and weak. The dense forest muffles your cries. There's no answer but the echo of your own voice and the rustling of leaves.",
      "choices": [
        { "text": "Continue shouting", "next": "call_help_continuous" },
        { "text": "Try to find a way to escape the car", "next": "find_escape" }
      ]
    },
    "call_help_continuous": {
      "text": "You keep shouting until your voice is raw, but no one answers. You realize that no one can hear you in this remote part of the forest. Despair starts to creep in.",
      "choices": [
        { "text": "Try to find a way to escape the car", "next": "find_escape" },
        { "text": "Give up and resign yourself to your fate", "next": "give_up" }
      ]
    },
    "find_escape": {
      "text": "You look around the car for a way to escape. The driver's side door is jammed shut, and the windows are all smashed. You notice a small opening in the back window.",
      "choices": [
        { "text": "Try to squeeze through the back window", "next": "squeeze_window" },
        { "text": "Search for something to use as a tool", "next": "search_tool" }
      ]
    },
    "wait_help": {
      "text": "You decide to wait for help, conserving your energy and trying to stay calm. You turn on the car radio, hoping to catch a signal, but all you hear is static.  Hours pass. The rain continues to fall.",
      "choices": [
        { "text": "Hear sounds in the forest", "next": "hear_sounds" },
        { "text": "Fall asleep from exhaustion", "next": "fall_asleep" }
      ]
    },
    "hear_sounds": {
      "text": "You hear a rustling sound in the undergrowth. It could be an animal... or it could be something else. You hold your breath and listen intently.",
      "choices": [
        { "text": "Investigate the sound", "next": "investigate_sound" },
        { "text": "Stay hidden in the car", "next": "stay_hidden_car" }
      ]
    },
    "fall_asleep": {
      "text": "Exhaustion finally overcomes you, and you drift off to sleep.  You wake up shivering, the car is growing colder.  You realize you've lost a lot of blood.",
      "choices": [
        { "text": "Try to find help", "next": "find_help_weak" }
      ]
    },
    "hike_house": {
      "text": "You grit your teeth and start the slow, painful trek towards the abandoned house you saw a few miles back. Every step sends a jolt of pain through your leg, but you're determined to reach shelter.",
      "choices": [
        { "text": "Follow the river path", "next": "river_path" },
        { "text": "Take the trail through the thick underbrush", "next": "thick_underbrush" }
      ]
    },
    "river_path": {
      "text": "The river path is slippery and treacherous, but it's easier going than through the dense forest. You limp along, using a fallen branch as a makeshift crutch.",
      "choices": [
        { "text": "Continue following the river", "next": "continue_river" },
        { "text": "Try to find a safer path", "next": "find_safer_path" }
      ]
    },
    "thick_underbrush": {
      "text": "You push your way through the thick underbrush, thorns tearing at your clothes and skin. The going is slow and difficult, and you're losing blood with every step.",
      "choices": [
        { "text": "Keep pushing forward", "next": "push_forward" },
        { "text": "Turn back to the river path", "next": "turn_back_river" }
      ]
    },
    "deep_forest": {
      "text": "The forest grows darker and more ominous as you venture deeper. The rain has stopped, but the air is heavy with the scent of damp earth and decaying leaves. You hear the distant howl of a wolf.",
      "choices": [
        { "text": "Proceed cautiously", "next": "proceed_cautious" },
        { "text": "Turn back to the car", "next": "turn_back" }
      ]
    },
    "away_path": {
      "text": "The path you've chosen is narrow and overgrown.  Thorns snag at your clothes, and you stumble over unseen roots.  As darkness falls, you realize you've completely lost your way.",
      "choices": [
        { "text": "Try to find a landmark to get your bearings", "next": "find_landmark" },
        { "text": "Press on, hoping to find a way out", "next": "press_on_lost" }
      ]
    },
    "make_shelter": {
      "text": "You gather branches and leaves to build a makeshift shelter. It's not much, but it offers some protection from the elements. You huddle inside, shivering from the cold and damp.",
      "choices": [
        { "text": "Try to start a fire", "next": "start_fire" },
        { "text": "Wait until morning", "next": "wait_morning" }
      ]
    },
    "towards_light": {
      "text": "You stumble through the darkness, following the distant light.  The terrain is rough, and you fall several times, scraping your hands and knees.  As you get closer, you realize the light is coming from a small cabin nestled among the trees.",
      "choices": [
        { "text": "Approach the cabin cautiously", "next": "approach_cabin" },
        { "text": "Stay hidden and observe the cabin", "next": "observe_cabin" }
      ]
    },
    "squeeze_window": {
    "text": "You carefully maneuver yourself through the broken back window, contorting your body to avoid the jagged edges. You manage to squeeze through, but you scrape your back and arms in the process.",
    "choices": [
        { "text": "Limp away from the car", "next": "limp_away" }
    ]
    },
    "search_tool": {
    "text": "You search the car for something to use as a tool to pry open the door or break a window. You find a tire iron in the trunk and a small multi-tool in the glove compartment.",
    "choices": [
        { "text": "Use the tire iron to try to pry open the door", "next": "pry_door" },
        { "text": "Use the multi-tool to try to break a window", "next": "break_window" }
    ]
    },
    "pry_door": {
    "text": "You wedge the tire iron into the door frame and try to pry it open. The metal creaks and groans, but the door doesn't budge. You try again, putting all your weight into it, and the tire iron snaps in half.",
    "choices": [
        { "text": "Try another method to escape", "next": "find_escape" }
    ]
    },
    "break_window": {
    "text": "You use the pliers on the multi-tool to try to break a window. The glass shatters, and you quickly clear away the shards. You reach in and unlock the door.",
    "choices": [
        { "text": "Carefully climb out of the car", "next": "climb_out" }
    ]
    },
    "limp_away": {
    "text": "You limp away from the car, your leg throbbing with pain. You're not sure where you're going, but you know you need to find help.",
    "choices": [
        { "text": "Follow the road", "next": "follow_road" },
        { "text": "Head into the forest", "next": "head_forest" }
    ]
    },
    "follow_road": {
    "text": "You follow the deserted road, hoping to find a house or a passing car. The rain has stopped, and the moon is starting to peek through the clouds.",
    "choices": [
        { "text": "Continue walking", "next": "continue_road" }
    ]
    },
    "head_forest": {
    "text": "You venture into the dark forest, the trees looming over you like giants. The ground is uneven, and you stumble over roots and rocks.",
    "choices": [
        { "text": "Continue deeper into the forest", "next": "deeper_forest" }
    ]
    },
    "continue_road": {
    "text": "You continue walking along the road, but there's no sign of civilization. You start to feel dizzy and weak from blood loss.",
    "choices": [
        { "text": "Press on", "next": "press_on_road" },
        { "text": "Rest by the side of the road", "next": "rest_road" }
    ]
    },
    "deeper_forest": {
    "text": "The trees loom larger here, their branches creating a thick canopy that blocks out most of the moonlight. Strange sounds echo through the darkness.",
    "choices": [
      { "text": "Look for shelter", "next": "make_shelter" },
      { "text": "Try to climb a tree for better visibility", "next": "find_landmark" }
    ]
    },
    "press_on_road": {
    "text": "You push yourself to keep going, but your vision starts to blur. You stumble and fall to the ground, unable to get back up.",
    "choices": [
        { "text": "Accept your fate", "next": "death" } 
    ]
    },
    "rest_road": {
    "text": "You sit down by the side of the road to rest. You close your eyes, hoping to regain some strength.",
    "choices": [
        { "text": "Wake up to the sound of an approaching vehicle", "next": "approaching_vehicle" }
    ]
    },
    "investigate_noise_forest": {
    "text": "You cautiously approach the source of the noise. You peer through the trees and see a pair of glowing eyes staring back at you.",
    "choices": [
      { "text": "Back away slowly", "next": "back_away_slowly" },
      { "text": "Investigate further", "next": "approach_well" }
    ]
    },
    "ignore_noise": {
    "text": "You ignore the noise and keep moving. You find a small stream and kneel down to take a drink.",
    "choices": [
        { "text": "Continue following the stream", "next": "follow_stream" }
    ]
    },
    "approaching_vehicle": {
    "text": "You open your eyes to the sound of an engine roaring in the distance. A pair of headlights appear through the trees, and a truck pulls up beside you.",
    "choices": [
        { "text": "Wave your arms to flag down the truck", "next": "flag_truck" }
    ]
    },
    "back_away_slowly": {
    "text": "You slowly back away from the glowing eyes, trying not to make any sudden movements. You turn and run, but you trip and fall.",
    "choices": [
        { "text": "Get up and keep running", "next": "keep_running_forest" }
    ]
    },
    "call_out_forest": {
    "text": "You call out, \"Hello? Is anyone there?\" The glowing eyes disappear, and you hear a low growl in response.",
    "choices": [
        { "text": "Run away as fast as you can", "next": "run_fast_forest" }
    ]
    },
    "follow_stream": {
    "text": "The stream winds through the forest. You hear the sound of rushing water getting louder - there might be a waterfall ahead.",
    "choices": [
      { "text": "Continue following the stream", "next": "head_clearing" },
      { "text": "Look for a way to cross", "next": "river_path" },
      { "text": "Rest by the stream", "next": "rest_stream" }
    ]
    },
    "flag_truck": {
    "text": "You wave your arms to flag down the truck. The truck driver sees you and slams on the brakes. He jumps out and rushes to your side.",
    "choices": [
        { "text": "Ask for help", "next": "ask_help" }
    ]
    },
    "keep_running_forest": {
    "text": "You scramble to your feet and run as fast as you can. You hear something chasing you, but you don't dare look back.",
    "choices": [
        { "text": "Keep running", "next": "keep_running_forest2" }
    ]
    },
    "run_fast_forest": {
    "text": "You turn and run, your heart pounding in your chest. You can hear the growls getting closer.",
    "choices": [
        { "text": "Keep running", "next": "keep_running_forest2" }
    ]
    },
    "head_clearing": {
    "text": "You emerge from the forest into a clearing. In the center of the clearing is a small, abandoned cabin.",
    "choices": [
        { "text": "Approach the cabin", "next": "approach_cabin2" }
    ]
    },
    "ask_help": {
    "text": "You tell the truck driver that you've been in an accident and need help. He helps you into his truck and calls for an ambulance.",
    "choices": [
        { "text": "You are safe", "next": "safe" }
    ]
    },
    "keep_running_forest2": {
    "text": "You keep running, but you're losing strength. You trip and fall, and something heavy lands on top of you.",
    "choices": [
        { "text": "Accept your fate", "next": "death" } 
    ]
    },
    "approach_cabin2": {
    "text": "You cautiously approach the cabin. The door is slightly ajar, and you can hear a faint noise coming from inside.",
    "choices": [
        { "text": "Push the door open and go inside", "next": "go_inside_cabin" }
    ]
    },
    "go_inside_cabin": {
    "text": "You push the door open and step inside. The cabin is dark and dusty, but there's a fire burning in the hearth. You hear a voice say, \"Welcome, traveler.\"",
    "choices": [
        { "text": "To be continued...", "next": "end" }
    ]
    },
    "stay_hidden": {
        "text": "You hold your breath and remain perfectly still, the damp leaves clinging to your clothes.  The wolves sniff and growl nearby, their hot breath ruffling the undergrowth.  After what feels like an eternity, their growls fade as they move on. You cautiously emerge, relieved but shaken.",
        "choices": [
        { "text": "Try to find your way back to the road", "next": "find_road_after_wolves" }
        ]
    },
    "run_from_hiding": {
        "text": "Panic overwhelms you, and you burst from your hiding spot, hoping to outrun the wolves.  You scramble through the undergrowth, branches whipping at your face.  The wolves are close behind, their snarls echoing through the trees.",
        "choices": [
        { "text": "Try to climb a tree", "next": "climb_tree_wolves" } 
        ]
    },
    "stay_hidden_car": {
        "text": "You stay hidden in the car, your eyes glued to the shadows outside.  The rustling sound grows louder, and you hear heavy footsteps approaching.  Something is out there, and it's getting closer.",
        "choices": [
        { "text": "Prepare to defend yourself", "next": "defend_in_car" }
        ]
    },
    "investigate_sound": {
        "text": "You carefully open the car door and step out, the rusty hinges creaking in the silence.  You follow the sound, your injured leg throbbing with each step.  The sound leads you deeper into the woods, away from the road.",
        "choices": [
        { "text": "Continue following the sound", "next": "follow_sound_deeper" }
        ]
    },
    "find_help_weak": {
        "text": "You know you need to find help, but you're weak and disoriented.  You stumble out of the car, the cold air biting at your skin.  You can barely see in the darkness.",
        "choices": [
        { "text": "Try to follow the road", "next": "follow_road" },
        { "text": "Head towards the faint glow in the distance", "next": "towards_light" }
        ]
    },
    "continue_river": {
        "text": "The river path winds through the forest, the sound of rushing water filling your ears.  The path becomes narrower, and you have to squeeze between rocks and overhanging branches.  You notice a faint light ahead.",
        "choices": [
        { "text": "Head towards the light", "next": "towards_light" }
        ]
    },
    "find_safer_path": {
        "text": "You leave the river path, hoping to find a safer route.  You climb a small hill, and from the top, you see the abandoned house in the distance.  It looks closer than you thought.",
        "choices": [
        { "text": "Head towards the abandoned house", "next": "approach_cabin2" } 
        ]
    },
    "push_forward": {
        "text": "You push through the thick underbrush, your clothes snagged and torn.  You're bleeding from countless scratches, and your leg is screaming in pain.  You stumble upon a clearing, and in the center, you see a well.",
        "choices": [
        { "text": "Approach the well", "next": "approach_well" }
        ]
    },
    "turn_back_river": {
        "text": "You realize you can't go any further through the underbrush.  You turn back and head towards the river path, hoping it will lead you to safety.",
        "choices": [
        { "text": "Follow the river path", "next": "river_path" }
        ]
    },
    "proceed_cautious": {
        "text": "You move cautiously through the dark forest, your senses on high alert.  You hear a twig snap behind you, and you whirl around, but there's nothing there.  You continue on, your heart pounding in your chest.",
        "choices": [
        { "text": "Keep moving deeper into the forest", "next": "deeper_forest" }
        ]
    },
    "turn_back": {
        "text": "You decide to turn back.  You retrace your steps, following the road back to your car.  You feel a sense of relief as you see the familiar wreckage in the distance.",
        "choices": [
        { "text": "Return to the car", "next": "crash_scene" }
        ]
    },
    "find_landmark": {
        "text": "You search for a landmark to help you get your bearings.  You climb a tall tree, hoping to see something familiar.  In the distance, you see a faint light.",
        "choices": [
        { "text": "Head towards the light", "next": "towards_light" }
        ]
    },
    "press_on_lost": {
        "text": "You press on, hoping to find a way out of the forest.  You wander for hours, but the trees seem to stretch on forever.  You're exhausted and disoriented.",
        "choices": [
        { "text": "Collapse from exhaustion", "next": "death" }
        ]
    },
    "start_fire": {
        "text": "You gather dry leaves and twigs and try to start a fire using your lighter.  Your hands are shaking, and it takes several tries, but finally, a small flame flickers to life.  You feel a surge of warmth and hope.",
        "choices": [
        { "text": "Stay by the fire and wait for morning", "next": "wait_morning_fire" }
        ]
    },
    "wait_morning": {
        "text": "You huddle in your makeshift shelter, shivering in the cold.  The night seems to stretch on forever.  You hear the sounds of animals moving through the forest, and you wonder if you'll survive until morning.",
        "choices": [
        { "text": "Wake up to the sound of birdsong", "next": "morning_shelter" }
        ]
    },
    "approach_cabin": {
        "text": "You approach the cabin cautiously, your footsteps muffled by the soft earth.  You peer through a window and see a dimly lit room with a figure sitting by the fire.",
        "choices": [
        { "text": "Knock on the door", "next": "knock_cabin" }
        ]
    },
    "observe_cabin": {
        "text": "From your hiding spot, you observe the cabin carefully. Through the window, you see someone moving inside. They appear to be cooking something over a fire.",
        "choices": [
          { "text": "Approach and knock", "next": "knock_cabin" },
          { "text": "Continue watching", "next": "sneak_closer_cabin" }
        ]
    },
    "climb_out": {
        "text": "You carefully climb out of the car, relieved to be free. You limp away from the wreckage, hoping to find help.",
        "choices": [
        { "text": "Limp away from the car", "next": "limp_away" }
        ]
    },
    "climb_tree_wolves": {
    "text": "You scramble up the nearest tree, your injured leg hindering your climb. The wolves snap and snarl at your heels, but you manage to pull yourself onto a sturdy branch. They circle the tree below, their howls echoing through the night.",
    "choices": [
      { "text": "Wait in the tree, hoping they'll leave", "next": "wait_in_tree" }
    ]
  },
  "defend_in_car": {
    "text": "You grip the tire iron tightly, heart pounding as footsteps approach...",
    "choices": [
      { "text": "Swing the tire iron at the door", "next": "swing_tire_iron" }
    ]
  },
  "follow_sound_deeper": {
    "text": "The sound leads you deeper into the darkness. You stumble over uneven ground, your injured leg throbbing with pain. As you push through some bushes, you find yourself in a small clearing with an old well in the center.",
    "choices": [
      { "text": "Investigate the well", "next": "approach_well" },
      { "text": "Try to find your way back", "next": "find_road_after_shelter" }
    ]
  },
  "approach_well": {
    "text": "As you near the well, you notice strange markings carved into its stone rim. A splash echoes from its depths.",
    "choices": [
      { "text": "Look down the well", "next": "drop_stone_well" },
      { "text": "Examine the markings", "next": "decipher_markings" },
      { "text": "Back away slowly", "next": "find_road_after_shelter" }
    ]
  },
  "decipher_markings": {
    "text": "The markings appear to be an ancient warning. As you study them, you hear footsteps approaching from behind.",
    "choices": [
      { "text": "Turn around quickly", "next": "encounter_stranger" },
      { "text": "Run away", "next": "run_from_well" }
    ]
  },

  "encounter_stranger": {
    "text": "You turn to find an old man in weathered clothes. 'I see you've found the well,' he says. 'Come, it's not safe here after dark.'",
    "choices": [
      { "text": "Follow him", "next": "ask_help_cabin" },
      { "text": "Decline his help", "next": "run_from_well" }
    ]
  },

  "run_from_well": {
    "text": "You sprint away from the well as fast as your injured leg allows. The forest seems less threatening in the direction you're running.",
    "choices": [
      { "text": "Keep running", "next": "find_road_after_shelter" }
    ]
  },
  "wait_morning_fire": {
    "text": "You sit by the fire, the warmth easing your pain and fear. The flames dance and crackle, casting flickering shadows on the trees.  You doze off, lulled by the comforting heat.",
    "choices": [
      { "text": "Wake up to the sound of birdsong", "next": "morning_shelter" }
    ]
  },
  "morning_shelter": {
    "text": "The morning light reveals your surroundings more clearly. You notice smoke rising in the distance - perhaps from a chimney.",
    "choices": [
      { "text": "Head towards the smoke", "next": "approach_cabin" },
      { "text": "Try to find the road", "next": "find_road_after_shelter" }
    ]
  },
  "knock_cabin": {
    "text": "You knock timidly on the cabin door.  The figure by the fire looks up, startled.  The door creaks open, revealing an old man with a kind face and a long white beard.",
    "choices": [
      { "text": "Ask for help", "next": "ask_help_cabin" }
    ]
  },
  "sneak_closer_cabin": {
    "text": "You try to sneak closer to the cabin, but you step on a twig, and it snaps loudly.  The figure inside the cabin turns towards the window, and you see a pair of glowing red eyes staring back at you.",
    "choices": [
      { "text": "Run away!", "next": "run_from_cabin" }
    ]
  },
  "find_road_after_wolves": {
    "text": "You carefully make your way through the undergrowth, following the sounds of the nearby road.  You emerge onto the gravel, relieved to find your bearings.  You see headlights approaching in the distance.",
    "choices": [
      { "text": "Wave your arms to flag down the car", "next": "flag_down_car" }
    ]
  },
  "wait_in_tree": {
    "text": "You cling to the tree branch, shivering in the cold night air. The wolves circle below, but as dawn approaches, they finally lose interest and move on.",
    "choices": [
      { "text": "Carefully climb down", "next": "find_road_after_wolves" },
      { "text": "Wait longer to be safe", "next": "morning_shelter" }
    ]
  },
  "swing_tire_iron": {
    "text": "You swing the tire iron with all your might, smashing it against the car door.  The door handle breaks off, and the creature outside lets out a howl of pain.  You hear it retreating into the darkness.",
    "choices": [
      { "text": "Try to escape through another window", "next": "climb_out" }
    ]
  },
  "call_help_lost": {
    "text": "You shout for help, your voice echoing through the silent forest.  But there's no answer.  You realize you're completely alone.",
    "choices": [
      { "text": "Give up and accept your fate", "next": "death" }
    ]
  },
  "drop_stone_well": {
    "text": "You pick up a small stone and drop it down the well.  You hear it splash into the water far below.  Suddenly, a long, slimy tentacle shoots up from the well, wrapping around your arm and pulling you towards the opening.",
    "choices": [
      { "text": "Struggle to break free", "next": "struggle_well" }
    ]
  },
  "find_road_after_shelter": {
    "text": "You follow the path you took the night before, hoping it will lead you back to the road.  You emerge from the trees and see the familiar gravel road stretching out before you.  You see a car approaching in the distance.",
    "choices": [
      { "text": "Wave your arms to flag down the car", "next": "flag_down_car" }
    ]
  },
  "ask_help_cabin": {
    "text": "You explain your situation to the old man, and he welcomes you inside.  He tends to your wounds and offers you food and a warm bed.  You are safe.",
    "choices": [
      { "text": "Stay at the cabin and recover", "next": "safe" }
    ]
  },
  "run_from_cabin": {
    "text": "You turn and run as fast as you can, the red eyes glowing in the darkness behind you.  You stumble and fall, but you scramble back to your feet and keep running.  You don't stop until you reach the road.",
    "choices": [
      { "text": "Follow the road", "next": "follow_road" }
    ]
  },
  "flag_down_car": {
    "text": "You wave your arms frantically as the car approaches.  The car slows down and pulls over.  The driver, a young woman with concerned eyes, rolls down the window.",
    "choices": [
      { "text": "Ask for help", "next": "ask_help_car" }
    ]
  },
  "ask_help_car": {
    "text": "You explain your situation to the woman, and she offers to take you to the nearest hospital.  You gratefully accept her help and climb into her car.  You are safe.",
    "choices": [
      { "text": "Go to the hospital", "next": "safe" }
    ]
  },
  "struggle_well": {
    "text": "You struggle against the slimy tentacle, but it's too strong. It pulls you closer to the well, and you can feel the cold, damp air rising from the depths. You catch a glimpse of something moving in the darkness below, something with many eyes and sharp teeth.",
    "choices": [
      { "text": "Scream for help", "next": "death" }, 
      { "text": "Try to pull yourself free", "next": "pull_free_well" } 
    ]
  },
  "pull_free_well": {
    "text": "You kick and struggle with all your might, trying to pry the tentacle off your arm. You manage to get a grip on the edge of the well, and with a final heave, you pull yourself free. The tentacle retracts into the darkness, and you collapse on the ground, shaking.",
    "choices": [
      { "text": "Crawl away from the well", "next": "crawl_away_well" }
    ]
  },
  "crawl_away_well": {
    "text": "You crawl away from the well, your heart pounding in your chest. You don't stop until you're far away from the clearing. You're exhausted and terrified, but you're alive.",
    "choices": [
      { "text": "Try to find your way back to the road", "next": "find_road_after_shelter" }
    ]
  },
    "death": {
    "text": "You have died.",
    "choices": []
    },
    "give_up": {
    "text": "You succumb to your injuries and the cold.",
    "choices": []
    },
    "end": {
    "text": "The End",
    "choices": []
    },
    "safe": {
    "text": "You are safe.  The truck driver takes you to the hospital where you receive the medical attention you need. You will make a full recovery.",
    "choices": []
    }
  }